package constant

import "sync"

const DefaultErrorId = 500

var (
	once         sync.Once
	commonMsgMap map[int]string
)

func init() {
	once.Do(func() {
		commonMsgMap = map[int]string{
			0:   "成功",
			500: "服务器异常",

			// 用户服务 && 鉴权服务
			1000: "二次确认密码不一致",
			1001: "用户名或密码错误",
			1002: "用户已存在，请登录",
			1003: "用户名或密码错误",
			1004: "无权限操作",
			1005: "已经在其他地方登录",
			1006: "登录过期，请重新登录",
			1007: "性别不存在",
			1008: "用户名已存在",
			1009: "资源不存在",
			1010: "账号已被冻结",

			// 商品服务
			2000: "更新商品信息失败",
			2001: "删除商品失败",
			2002: "新增商品失败",
			2003: "查询商品失败",
			2004: "商品不存在",
			2005: "商品已下架",
			2006: "商品库存不足",
			2007: "商品已售完",
			2008: "商品已下单",
			2009: "商品已售空",
			2010: "商品已锁定",
			2011: "商品已过期",
			2012: "商品库存不足",
			2013: "商品搜索失败",
			// 类别
			2014: "商品分类新增失败",
			2015: "商品分类删除失败",
			2016: "商品分类更新失败",
			2017: "商品分类查询失败",
			// 品牌
			2018: "商品品牌新增失败",
			2019: "商品品牌删除失败",
			2020: "商品品牌更新失败",
			2021: "商品品牌查询失败",

			// 支付服务
			5000: "支付异常",
		}
	})
}

func GetMsg(errorId int) string {
	if msg, ok := commonMsgMap[errorId]; ok {
		return msg
	}

	return commonMsgMap[DefaultErrorId]
}
